socialNetwork/runs/e2e-read-home-timelines-2-QFSl/output.txt
Running 30s test @ http://localhost:8080/wrk2-api/home-timeline/read
  4 threads and 64 connections

  Thread calibration: mean lat.: 14.948ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 14.902ms, rate sampling interval: 44ms
  Thread calibration: mean lat.: 15.237ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 14.775ms, rate sampling interval: 45ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.96ms    7.89ms  44.00ms   87.59%
    Req/Sec   252.67     78.38   444.00     67.26%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.57ms
 75.000%   18.82ms
 90.000%   24.77ms
 99.000%   44.00ms
 99.900%   90.05ms
 99.990%  109.38ms
 99.999%  130.88ms
100.000%  130.88ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.735     0.000000            1         1.00
       9.575     0.100000         2021         1.11
      10.455     0.200000         4004         1.25
      11.295     0.300000         6005         1.43
      12.311     0.400000         8007         1.67
      13.575     0.500000        10019         2.00
      14.359     0.550000        11018         2.22
      15.231     0.600000        12012         2.50
      16.351     0.650000        13012         2.86
      17.535     0.700000        14016         3.33
      18.815     0.750000        15014         4.00
      19.567     0.775000        15519         4.44
      20.335     0.800000        16012         5.00
      21.151     0.825000        16513         5.71
      22.143     0.850000        17014         6.67
      23.375     0.875000        17515         8.00
      24.031     0.887500        17765         8.89
      24.767     0.900000        18020        10.00
      25.759     0.912500        18263        11.43
      26.863     0.925000        18514        13.33
      28.335     0.937500        18763        16.00
      29.167     0.943750        18888        17.78
      30.079     0.950000        19017        20.00
      30.927     0.956250        19140        22.86
      32.271     0.962500        19265        26.67
      33.695     0.968750        19388        32.00
      34.463     0.971875        19451        35.56
      35.263     0.975000        19513        40.00
      36.287     0.978125        19577        45.71
      37.631     0.981250        19638        53.33
      39.231     0.984375        19703        64.00
      40.063     0.985938        19733        71.11
      41.471     0.987500        19763        80.00
      43.391     0.989062        19795        91.43
      44.671     0.990625        19826       106.67
      46.367     0.992188        19857       128.00
      47.807     0.992969        19873       142.22
      49.215     0.993750        19888       160.00
      50.943     0.994531        19904       182.86
      52.991     0.995313        19920       213.33
      55.743     0.996094        19935       256.00
      57.759     0.996484        19943       284.44
      59.455     0.996875        19951       320.00
      62.239     0.997266        19959       365.71
      66.623     0.997656        19967       426.67
      73.023     0.998047        19974       512.00
      74.495     0.998242        19978       568.89
      80.639     0.998437        19982       640.00
      84.927     0.998633        19986       731.43
      88.319     0.998828        19990       853.33
      90.111     0.999023        19994      1024.00
      90.431     0.999121        19996      1137.78
      92.415     0.999219        19998      1280.00
      94.015     0.999316        20000      1462.86
      94.911     0.999414        20002      1706.67
      97.791     0.999512        20004      2048.00
      99.455     0.999561        20005      2275.56
      99.839     0.999609        20006      2560.00
      99.903     0.999658        20007      2925.71
     100.543     0.999707        20008      3413.33
     105.407     0.999756        20009      4096.00
     105.407     0.999780        20009      4551.11
     107.327     0.999805        20010      5120.00
     107.327     0.999829        20010      5851.43
     109.375     0.999854        20011      6826.67
     109.375     0.999878        20011      8192.00
     109.375     0.999890        20011      9102.22
     116.799     0.999902        20012     10240.00
     116.799     0.999915        20012     11702.86
     116.799     0.999927        20012     13653.33
     116.799     0.999939        20012     16384.00
     116.799     0.999945        20012     18204.44
     130.879     0.999951        20013     20480.00
     130.879     1.000000        20013          inf
#[Mean    =       15.963, StdDeviation   =        7.891]
#[Max     =      130.816, Total count    =        20013]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  29926 requests in 29.99s, 418.82MB read
Requests/sec:    997.71  
Transfer/sec:     13.96MB